Revit 2024 API
StructuralSectionIWideFlange.BoltSpacingBetweenRows Property
 Standard bolt spacing between rows, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltSpacingBetweenRows { get; set; }
Visual Basic
Public Property BoltSpacingBetweenRows As Double
	Get
	Set
Visual C++
public:
property double BoltSpacingBetweenRows {
	double get ();
	void set (double value);
}
See Also
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace